raitraak-rrk/RFStamp-BitCloud/BitCloud/Components/HAL/cortexm0+/atsamr21/common/src/halUsb.c
	if (callback_type == USB_DEVICE_ENDPOINT_CALLBACK_TRFAIL) {
		if (ep_num == 0) { // control endpoint
			module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPINTENCLR.reg = USB_DEVICE_EPINTENCLR_TRFAIL0 | USB_DEVICE_EPINTENCLR_TRFAIL1;
		} else if (ep & USB_EP_DIR_IN) {
			module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPINTENCLR.reg = USB_DEVICE_EPINTENCLR_TRFAIL1;
		} else {
			module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPINTENCLR.reg = USB_DEVICE_EPINTENCLR_TRFAIL0;
		}
	}

	if (callback_type == USB_DEVICE_ENDPOINT_CALLBACK_RXSTP) {
		module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPINTENCLR.reg = USB_DEVICE_EPINTENCLR_RXSTP;
	}

	if (callback_type == USB_DEVICE_ENDPOINT_CALLBACK_STALL) {
		if (ep & USB_EP_DIR_IN) {
			module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPINTENCLR.reg = USB_DEVICE_EPINTENCLR_STALL1;
		} else {
			module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPINTENCLR.reg = USB_DEVICE_EPINTENCLR_STALL0;
		}
	}

	return STATUS_OK;
}

/**
 * \brief Initializes an USB device endpoint configuration structure to defaults.
 *
 * Initializes a given USB device endpoint configuration structure to a
 * set of known default values. This function should be called on all new
 * instances of these configuration structures before being modified by the
 * user application.
 *
 * The default configuration is as follows:
 * \li endpoint address is 0
 * \li endpoint size is 8 bytes
 * \li auto_zlp is false
 * \li endpoint type is control
 *
 * \param[out] ep_config  Configuration structure to initialize to default values
 */
void usb_device_endpoint_get_config_defaults(struct usb_device_endpoint_config *ep_config)
{
	/* Write default config to config struct */
	ep_config->ep_address = 0;
	ep_config->ep_size = USB_ENDPOINT_8_BYTE;
	ep_config->auto_zlp = false;
	ep_config->ep_type = USB_DEVICE_ENDPOINT_TYPE_CONTROL;
}

void usb_device_restore_descriptor_bank (void)
{  
  #if (UDI_CDC_DATA_EPS_FS_SIZE <= 8)
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_8_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_8_BYTE;
  }
  #elif (UDI_CDC_DATA_EPS_FS_SIZE <= 16)
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_16_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_16_BYTE;
  }
  #elif (UDI_CDC_DATA_EPS_FS_SIZE <= 32)
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_32_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_32_BYTE;
  }
  #elif (UDI_CDC_DATA_EPS_FS_SIZE <= 64)
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_64_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_64_BYTE;
  }
  #elif (UDI_CDC_DATA_EPS_FS_SIZE <= 128)
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_128_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_128_BYTE;
  }
  #elif (UDI_CDC_DATA_EPS_FS_SIZE <= 256)
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_256_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_256_BYTE;
  }
  #elif (UDI_CDC_DATA_EPS_FS_SIZE <= 512)
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_512_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_512_BYTE;
  }
  #elif (UDI_CDC_DATA_EPS_FS_SIZE <= 1023)
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_1023_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_1023_BYTE;
  }
  #else
  {
    usb_descriptor_table.usb_endpoint_table[1].DeviceDescBank[1].PCKSIZE.bit.SIZE = USB_ENDPOINT_64_BYTE;
    usb_descriptor_table.usb_endpoint_table[2].DeviceDescBank[0].PCKSIZE.bit.SIZE = USB_ENDPOINT_64_BYTE;
  }
  #endif
}

/**
 * \brief Writes an USB device endpoint configuration to the hardware module.
 *
 * Writes out a given configuration of an USB device endpoint
 * configuration to the hardware module. If the pipe is already configured,
 * the new configuration will replace the existing one.
 *
 * \param[in] module_inst    Pointer to USB software instance struct
 * \param[in] ep_config      Configuration settings for the endpoint
 *
 * \return Status of the device endpoint configuration operation
 * \retval STATUS_OK         The device endpoint was configured successfully
 * \retval STATUS_ERR_DENIED The endpoint address is already configured
 */
int usb_device_endpoint_set_config(struct usb_module *module_inst,
		struct usb_device_endpoint_config *ep_config)
{
	uint8_t ep_num = ep_config->ep_address & USB_EP_ADDR_MASK;
	uint8_t ep_bank = (ep_config->ep_address & USB_EP_DIR_IN) ? 1 : 0;

	switch (ep_config->ep_type) {
		case USB_DEVICE_ENDPOINT_TYPE_DISABLE:
			module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPCFG.reg = USB_DEVICE_EPCFG_EPTYPE0(0) |  USB_DEVICE_EPCFG_EPTYPE1(0);
			return STATUS_OK;

		case USB_DEVICE_ENDPOINT_TYPE_CONTROL:
			if ((module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPCFG.reg & USB_DEVICE_EPCFG_EPTYPE0_Msk) == 0 && \
				(module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPCFG.reg & USB_DEVICE_EPCFG_EPTYPE1_Msk) == 0) {
				module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPCFG.reg = USB_DEVICE_EPCFG_EPTYPE0(1) | USB_DEVICE_EPCFG_EPTYPE1(1);
				module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPSTATUSSET.reg = USB_DEVICE_EPSTATUSSET_BK0RDY;
				module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPSTATUSCLR.reg = USB_DEVICE_EPSTATUSCLR_BK1RDY;
			} else {
				return STATUS_ERR_DENIED;
			}
			if (true == ep_config->auto_zlp) {
				usb_descriptor_table.usb_endpoint_table[ep_num].DeviceDescBank[0].PCKSIZE.reg |= USB_DEVICE_PCKSIZE_AUTO_ZLP;
				usb_descriptor_table.usb_endpoint_table[ep_num].DeviceDescBank[1].PCKSIZE.reg |= USB_DEVICE_PCKSIZE_AUTO_ZLP;
			} else {
				usb_descriptor_table.usb_endpoint_table[ep_num].DeviceDescBank[0].PCKSIZE.reg &= ~USB_DEVICE_PCKSIZE_AUTO_ZLP;
				usb_descriptor_table.usb_endpoint_table[ep_num].DeviceDescBank[1].PCKSIZE.reg &= ~USB_DEVICE_PCKSIZE_AUTO_ZLP;
			}
			usb_descriptor_table.usb_endpoint_table[ep_num].DeviceDescBank[0].PCKSIZE.bit.SIZE = ep_config->ep_size;
			usb_descriptor_table.usb_endpoint_table[ep_num].DeviceDescBank[1].PCKSIZE.bit.SIZE = ep_config->ep_size;
			return STATUS_OK;

		case USB_DEVICE_ENDPOINT_TYPE_ISOCHRONOUS:
			if (ep_bank) {
				if ((module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPCFG.reg & USB_DEVICE_EPCFG_EPTYPE1_Msk) == 0){
					module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPCFG.reg |= USB_DEVICE_EPCFG_EPTYPE1(2);
					module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPSTATUSCLR.reg = USB_DEVICE_EPSTATUSCLR_BK1RDY;
				} else {
					return STATUS_ERR_DENIED;
				}
			} else {
				if ((module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPCFG.reg & USB_DEVICE_EPCFG_EPTYPE0_Msk) == 0){
					module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPCFG.reg |= USB_DEVICE_EPCFG_EPTYPE0(2);
					module_inst->hw->DEVICE.DeviceEndpoint[ep_num].EPSTATUSSET.reg = USB_DEVICE_EPSTATUSSET_BK0RDY;
				} else {
					return STATUS_ERR_DENIED;
				}
			}
			break;

