raitraak-rrk/RFStamp-BitCloud/BitCloud/Components/HAL/cortexm0+/atsamr21/common/src/halUsb.c
	/* Associate the software module instance with the hardware module */
	module_inst->hw = hw;
  if(!(USB_CTRLA & USB_CTRLA_ENABLE))
  {
    /* Turn on the digital interface clock */
      /* enable the clock of USB */
    PM_APBBMASK |= PM_APBBMASK_USB;
    /* Set up the USB DP/DN pins */

    usbPinConfig.portNum = PORT_A;
    usbPinConfig.pinNum = 24;
    usbPinConfig.functionConfig = 6;
    GPIO_pinfunc_config(&usbPinConfig);
    
    usbPinConfig.portNum = PORT_A;
    usbPinConfig.pinNum = 25;
    usbPinConfig.functionConfig = 6;
    GPIO_pinfunc_config(&usbPinConfig);

    /* Setup clock for module */
    
    GCLK_CLKCTRL_s.id = GCLK_USB;
    GCLK_CLKCTRL_s.gen = module_config->source_generator;
    GCLK_CLKCTRL_s.clken = 1;

    /* Reset */
    hw->DEVICE.CTRLA.bit.SWRST = 1;
    while (hw->DEVICE.SYNCBUSY.bit.SWRST) {
      /* Sync wait */
    }

    /* Load Pad Calibration */
    pad_transn =( *((uint32_t *)(NVMCTRL_OTP4)
        + (NVM_USB_PAD_TRANSN_POS / 32))
      >> (NVM_USB_PAD_TRANSN_POS % 32))
      & ((1 << NVM_USB_PAD_TRANSN_SIZE) - 1);

    if (pad_transn == 0x1F) {
      pad_transn = 5;
    }

    hw->DEVICE.PADCAL.bit.TRANSN = pad_transn;

    pad_transp =( *((uint32_t *)(NVMCTRL_OTP4)
        + (NVM_USB_PAD_TRANSP_POS / 32))
        >> (NVM_USB_PAD_TRANSP_POS % 32))
        & ((1 << NVM_USB_PAD_TRANSP_SIZE) - 1);

    if (pad_transp == 0x1F) {
      pad_transp = 29;
    }

    hw->DEVICE.PADCAL.bit.TRANSP = pad_transp;

    pad_trim =( *((uint32_t *)(NVMCTRL_OTP4)
        + (NVM_USB_PAD_TRIM_POS / 32))
        >> (NVM_USB_PAD_TRIM_POS % 32))
        & ((1 << NVM_USB_PAD_TRIM_SIZE) - 1);

    if (pad_trim == 0x7) {
      pad_trim = 3;
    }

    hw->DEVICE.PADCAL.bit.TRIM = pad_trim;

    /* Set the configuration */
    hw->DEVICE.CTRLA.bit.MODE = module_config->select_host_mode;
    hw->DEVICE.CTRLA.bit.RUNSTDBY = module_config->run_in_standby;
    hw->DEVICE.DESCADD.reg = (uint32_t)(&usb_descriptor_table.usb_endpoint_table[0]);
    if (USB_SPEED_FULL == module_config->speed_mode) {
      module_inst->hw->DEVICE.CTRLB.bit.SPDCONF = USB_DEVICE_CTRLB_SPDCONF_FS_Val;
    } else if(USB_SPEED_LOW == module_config->speed_mode) {
      module_inst->hw->DEVICE.CTRLB.bit.SPDCONF = USB_DEVICE_CTRLB_SPDCONF_LS_Val;
    }

    memset((uint8_t *)(&usb_descriptor_table.usb_endpoint_table[0]), 0,
        sizeof(usb_descriptor_table.usb_endpoint_table));

  #ifdef USB_HOST_SUPPORT
    /* callback related init */
    for (i = 0; i < USB_HOST_CALLBACK_N; i++) {
      module_inst->host_callback[i] = NULL;
    };
    for (i = 0; i < USB_PIPE_NUM; i++) {
      for (j = 0; j < USB_HOST_PIPE_CALLBACK_N; j++) {
        module_inst->host_pipe_callback[i][j] = NULL;
      }
    };
    module_inst->host_registered_callback_mask = 0;
    module_inst->host_enabled_callback_mask = 0;
    for (i = 0; i < USB_PIPE_NUM; i++) {
      module_inst->host_pipe_registered_callback_mask[i] = 0;
      module_inst->host_pipe_enabled_callback_mask[i] = 0;
    }
  #endif //#ifdef USB_HOST_SUPPORT

    /*  device callback related */
    for (i = 0; i < USB_DEVICE_CALLBACK_N; i++) {
      module_inst->device_callback[i] = NULL;
    }
    for (i = 0; i < USB_EPT_NUM; i++) {
      for(j = 0; j < USB_DEVICE_EP_CALLBACK_N; j++) {
        module_inst->device_endpoint_callback[i][j] = NULL;
      }
    }
    module_inst->device_registered_callback_mask = 0;
    module_inst->device_enabled_callback_mask = 0;
    for (j = 0; j < USB_EPT_NUM; j++) {
      module_inst->deivce_endpoint_registered_callback_mask[j] = 0;
      module_inst->device_endpoint_enabled_callback_mask[j] = 0;
    }
  }
  else
  {
    resetReason = hw->DEVICE.DESCADD.reg;
    /*Restore the device descriptor address after the reset*/
    hw->DEVICE.DESCADD.reg = (uint32_t)(&usb_descriptor_table.usb_endpoint_table[0]);
    udd_ctrl_epn_enable(module_inst);
    udi_cdc_comm_enable();
    udi_cdc_data_enable();
    udc_restore();
  }
  return STATUS_OK;
}
void halUsbEnableInterrupt(void)
{
  /* Enable interrupts for this USB module */  
  HAL_InstallInterruptVector(USB_IRQn, usb_device_interrupt_handler);

  /* Clear & disable USB interrupt on NVIC */
  NVIC_DisableIRQ(USB_IRQn);
  NVIC_ClearPendingIRQ(USB_IRQn);
  /* set priority & enable USB interrupt on NVIC */
  NVIC_EnableIRQ(USB_IRQn);
  
}
#endif /*#if defined(HAL_USE_USB)*/
